{
    "ticker": "AAPL",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q1",
    "timeframe": {
      "quarter_start": "2024-09-29",
      "quarter_end": "2024-12-28",
      "earnings_release_date": "2025-01-30"
    },
    "documents": [
      {
        "id": "aapl-fy25-q1-001",
        "title": "Apple reports first quarter results",
        "source_name": "Apple Newsroom",
        "source_type": "official",
        "source_url": "https://www.apple.com/newsroom/2025/01/apple-reports-first-quarter-results/",
        "published_at": "2025-01-30T00:00:00Z",
        "category": "earnings_release",
        "tags": [
          "results_headline",
          "all_time_record",
          "services_record",
          "installed_base",
          "dividend"
        ],
        "relevance_notes": "Primary, authoritative summary of Apple’s FY25 Q1 results including revenue, EPS, and dividend; anchor for all other commentary.",
        "embeddings_text": "In its official press release for fiscal 2025 first quarter results, Apple reports that the quarter ended December 28, 2024 and delivered all-time records for both total company revenue and earnings per share. Revenue reached 124.3 billion dollars, up 4 percent year over year, and diluted EPS reached 2.40 dollars, up 10 percent year over year. Management highlights that Services revenue hit a new all-time high and that the installed base of active devices across all product categories and regions reached a new record level. CEO Tim Cook frames the quarter as Apple’s best ever, emphasizing strong holiday demand for the current product lineup and the early impact of Apple Intelligence in making apps and experiences more personal. The release notes that Apple Intelligence will expand to additional languages in April, extending its reach beyond the initial English-language launch. Apple’s board declares a cash dividend of 0.25 dollars per share, payable on February 13, 2025 to shareholders of record as of February 10, 2025. The press release also reiterates standard risk-factor language around macroeconomic conditions, regulatory scrutiny, supply-chain vulnerabilities, and legal proceedings and directs investors to Apple’s SEC filings for full detail."
      },
      {
        "id": "aapl-fy25-q1-002",
        "title": "Apple’s reports record revenue for Q1 2025 (with charts)",
        "source_name": "Six Colors",
        "source_type": "commentary",
        "source_url": "https://sixcolors.com/post/2025/01/apples-reports-record-revenue-for-q1-2025/",
        "published_at": "2025-01-30T13:39:00Z",
        "category": "results_analysis",
        "tags": [
          "segment_mix",
          "iphone_decline",
          "mac_growth",
          "ipad_growth",
          "services_growth",
          "wearables_decline"
        ],
        "relevance_notes": "Concise breakdown of YoY growth by product line and charts showing mix shifts; good for modeling segment contribution and trend direction in FY25 Q1.",
        "embeddings_text": "A Six Colors analysis of Apple’s fiscal Q1 2025 results emphasizes that the quarter was an all-time revenue record at 124.3 billion dollars, up 4 percent from the year-ago period and surpassing the previous record set three years earlier. The most notable datapoint is that iPhone revenue declined by roughly 1 percent year over year, which is important given that the iPhone still represents more than half of total company revenue. In contrast, Mac revenue jumped about 16 percent, iPad revenue increased roughly 15 percent, and Services grew around 14 percent. The previously sluggish Wearables, Home, and Accessories category declined about 2 percent. Charts in the article visualize total revenue, profit, gross margin, and product-line contributions, highlighting the growing weight of Services in Apple’s business and the renewed strength of Mac and iPad during the quarter. The commentary frames Q1 2025 as an example of how Apple can still deliver record results even in a quarter where the iPhone underperforms, because multiple other segments are growing at double-digit rates and Services continues to compound from a large base."
      },
      {
        "id": "aapl-fy25-q1-003",
        "title": "Apple's Earnings Top Estimates as Services Revenue Grows, But iPhone Sales Fall Short",
        "source_name": "Investopedia",
        "source_type": "news",
        "source_url": "https://www.investopedia.com/apple-earnings-q1-fy-2025-8782696",
        "published_at": "2025-01-30T00:00:00Z",
        "category": "results_analysis",
        "tags": [
          "services_record",
          "iphone_underperformance",
          "china_headwinds",
          "stock_reaction"
        ],
        "relevance_notes": "Adds explicit segment revenue figures and market-reaction color, including China weakness and AI availability issues; useful for sentiment and regional context.",
        "embeddings_text": "An Investopedia recap of Apple’s fiscal Q1 2025 results notes that earnings topped analyst expectations, with revenue rising 4 percent year over year to 124.3 billion dollars and earnings per share reaching an all-time high of 2.40 dollars versus expectations around 2.35 dollars. Services revenue grew 14 percent to about 26.34 billion dollars, underscoring Services as a key growth driver. Mac and iPad also delivered significant increases, with Mac revenue around 8.99 billion dollars and iPad revenue roughly 8.08 billion dollars. In contrast, iPhone revenue fell just under 1 percent to approximately 69.14 billion dollars, missing some investor hopes for reacceleration despite strong global demand for the iPhone 16 lineup. The article attributes much of the iPhone shortfall to weakness in China, where intensified competition from local brands such as Huawei and Vivo, along with regulatory hurdles that limit the availability of Apple Intelligence features, have weighed on demand. Wearables, Home, and Accessories revenue is cited at about 11.75 billion dollars, down modestly year over year. Despite these pockets of weakness, Apple’s stock rises roughly 3 percent in extended trading as investors focus on the EPS beat, robust Services growth, and resilient overall profitability."
      },
      {
        "id": "aapl-fy25-q1-004",
        "title": "Apple reports record revenue in Q1 2025 amid China iPhone slump",
        "source_name": "Leverage Shares Insights",
        "source_type": "commentary",
        "source_url": "https://leverageshares.com/en-eu/insights/apple-reports-record-revenue-in-q1-2025/",
        "published_at": "2025-02-03T00:00:00Z",
        "category": "results_analysis",
        "tags": [
          "gross_margin",
          "china_iphone_sales",
          "ai_limitations_china",
          "profitability",
          "mac_ipad_services_strength"
        ],
        "relevance_notes": "Provides detailed margin and profit metrics plus a focused discussion of the sharp iPhone unit decline in China and competitive/AI dynamics there.",
        "embeddings_text": "A Leverage Shares analysis of Apple’s Q1 2025 earnings underscores that the company generated 124.3 billion dollars in revenue, up about 3.9 percent year over year, with a gross margin of roughly 46.9 percent. Net income is reported at 36.33 billion dollars, up a little more than 7 percent year over year, and diluted EPS at 2.40 dollars, up about 10 percent. Operating income for the quarter is cited at approximately 42.83 billion dollars, and research and development expenses rose to around 8.27 billion dollars, reflecting increased investment in Apple Intelligence and other long-term initiatives. Segment commentary aligns with other sources: Services revenue grew 14 percent, Mac and iPad revenues increased around the mid-teens, and iPhone revenue declined about 1 percent. The article focuses in particular on Apple’s challenges in China, noting that iPhone sales there fell by over 18 percent in the December quarter according to third-party data, with the iPhone slipping from the top position to third place in the Chinese smartphone rankings. This weakness is attributed to rising competition from domestic brands and to the fact that Apple Intelligence features are not broadly available in China due to regulatory constraints, reducing the perceived differentiation of the iPhone 16 family. The analysis concludes that while Apple’s overall Q1 2025 results show resilience thanks to Services and Mac/iPad strength, sustained pressure in China and uncertainty around AI feature rollouts in that market remain important risk factors for future quarters."
      },
      {
        "id": "aapl-fy25-q1-005",
        "title": "This is Tim (and Kevan!): Apple’s Q1 results call, transcribed",
        "source_name": "Six Colors",
        "source_type": "transcript",
        "source_url": "https://sixcolors.com/post/2025/01/this-is-tim-and-kevan-apples-q1-results-call-transcribed/",
        "published_at": "2025-01-30T14:28:00Z",
        "category": "earnings_call",
        "tags": [
          "apple_intelligence_rollout",
          "installed_base_2_35b",
          "china_down_11pct",
          "services_record",
          "ai_strategy",
          "guidance"
        ],
        "relevance_notes": "Rich source of qualitative management commentary on Apple Intelligence, device installed base, regional performance, especially China, and guidance for the March quarter.",
        "embeddings_text": "The Six Colors transcript of Apple’s fiscal Q1 2025 earnings call captures extensive commentary from CEO Tim Cook and CFO Kevan Parekh about the quarter and Apple’s strategic priorities. Cook opens by reiterating that Q1 2025 produced all-time records for revenue and EPS and that Apple achieved all-time revenue records across most regions, including the Americas, Europe, Japan, and the rest of Asia-Pacific. He notes that Services reached an all-time revenue record and that the installed base of active devices has climbed to more than 2.35 billion. Cook provides a detailed overview of Apple Intelligence, explaining that the first set of features launched in U.S. English in October on iPhone, iPad, and Mac, with more features and countries added in December. These capabilities include system-wide Writing Tools, image creation via Image Playground and Genmoji, visual understanding features, a more conversational Siri, and new photo and memory tools, backed by on-device models and Private Cloud Compute. Cook outlines an April expansion that will bring Apple Intelligence to additional languages such as French, German, Italian, Spanish, Portuguese, Japanese, Korean, and simplified Chinese, as well as localized English variants for Singapore and India. Parekh’s prepared remarks quantify the results: products revenue of about 98 billion dollars, Services revenue of 26.3 billion dollars (up 14 percent), company gross margin of 46.9 percent, and record net income of 36.3 billion dollars. He highlights that iPhone revenue of 69.1 billion dollars was roughly flat year over year, Mac revenue was 9 billion dollars (up 16 percent), iPad revenue was 8.1 billion dollars (up 15 percent), and Wearables, Home, and Accessories revenue was 11.7 billion dollars, down 2 percent. In the Q&A, Cook stresses that markets where Apple Intelligence is available have seen better iPhone 16 performance than markets where it is not, and confirms that Greater China revenue declined 11 percent year over year, with more than half of the drop tied to channel inventory changes. He notes that Apple has not yet rolled out Apple Intelligence in China and that the region remains highly competitive. Parekh’s guidance for the March quarter calls for low- to mid-single-digit revenue growth year over year, Services growth in the low double digits, gross margin between 46.5 and 47.5 percent, and operating expenses around 15.1 to 15.3 billion dollars. Overall, the transcript is a critical resource for understanding management’s view of AI, regional demand, competitive dynamics, and near-term financial expectations."
      },
      {
        "id": "aapl-fy25-q1-006",
        "title": "What Analysts Think of Apple Stock Ahead of Earnings (Q1 FY2025)",
        "source_name": "Investopedia",
        "source_type": "news",
        "source_url": "https://www.investopedia.com/what-analysts-think-of-apple-stock-ahead-of-earnings-q1-fy2025-8780951",
        "published_at": "2025-01-30T15:57:00Z",
        "category": "pre_earnings_sentiment",
        "tags": [
          "analyst_ratings",
          "price_targets",
          "consensus_estimates",
          "china_risk",
          "ai_perception"
        ],
        "relevance_notes": "Captures pre-print expectations and narrative, useful for modeling surprise vs. consensus and framing investor focus on China and AI going into Q1 2025.",
        "embeddings_text": "A pre-earnings Investopedia article surveys Wall Street expectations for Apple just before the Q1 2025 release. It reports that analysts projected fiscal first-quarter revenue of about 124.38 billion dollars, up roughly 4 percent year over year, and expected earnings of about 35.62 billion dollars, or 2.35 dollars per share, up from 2.18 dollars per share a year earlier. Consensus forecasts called for iPhone revenue to grow about 2 percent to approximately 70.72 billion dollars, with modest growth in Mac and iPad and high-single- to low-double-digit growth in Services. The piece highlights that analysts are closely watching Apple’s exposure to China, where the company still manufactures a large majority of its hardware, and where demand has come under pressure from local competitors and regulatory constraints that limit the rollout of Apple Intelligence features. It notes that Apple’s stock is down double-digits year to date going into the report, despite the company’s perceived defensive qualities, and that the key questions for investors center on whether the iPhone 16 cycle can stabilize growth, how fast Services can continue compounding, and how Apple will manage trade and regulatory risks. The article also summarizes analyst ratings and targets, describing a majority buy rating with a smaller contingent of hold and sell ratings, and a consensus price target that implies mid-single- to high-single-digit upside from the pre-earnings share price."
      }
    ]
  }
  