{
  "company_name": "Meta",
  "quarter": "Q1",
  "fiscal_year": "2025",
  "speakers": {
    "mark_zuckerberg": {
      "role": "Chief Executive Officer",
      "responses": [
        {
          "topic": "Five AI-driven opportunities",
          "content": "AI is transforming ads, engagement, business messaging, Meta AI, and AI devices; we are investing in each downstream of our general intelligence and infrastructure builds." 
        },
        {
          "topic": "Meta AI scale and personalization",
          "content": "Almost 1B monthly actives use Meta AI; we are deepening personalization, voice, entertainment, and building the standalone Meta AI app while integrating it deeply across WhatsApp, Facebook, Instagram, and Threads." 
        },
        {
          "topic": "AI devices and glasses",
          "content": "Ray-Ban Meta AI glasses have tripled sales year over year, voice usage is accelerating, live translations are rolling out globally, and Quest 3S/Vision tools continue to expand Horizon experiences." 
        },
        {
          "topic": "Llama roadmap",
          "content": "We released the first Llama 4 models and are building Behemoth; longer context windows and low-latency models let us distill intelligence into efficient, personalized services for Meta AI and monetization." 
        }
      ]
    },
    "susan_li": {
      "role": "Chief Financial Officer",
      "responses": [
        {
          "topic": "Q1 results",
          "content": "Revenue $42.3B (+16%, +19% constant currency), operating income $17.6B (41% margin), net income $16.6B, EPS $6.43, free cash flow $10.3B; share repurchases $13.4B, dividends $1.3B, ending cash ~$70.2B."
        },
        {
          "topic": "Family of Apps performance",
          "content": "Family revenue $41.9B (+16%), ads $41.4B (+16% / +20% cc); DAP grew to 3.4B, impressions +5%, average price per ad +10%, business messaging and Advantage+ Creative momentum, Threads monetization and ads ramping gradually."
        },
        {
          "topic": "Reality Labs traction",
          "content": "Reality Labs revenue $412M (-6%) while expenses grew 8% to $4.6B; Ray-Ban Meta AI glasses MAUs and voice activity accelerating, live translations launching, and VR engagement improving with Quest 3S."
        },
        {
          "topic": "CapEx and infrastructure outlook",
          "content": "CapEx $13.7B; full-year guide raised to $64-72B to fund data center builds and higher hardware costs while keeping most spend directed to core business and flexible deployment." 
        },
        {
          "topic": "Expense and tax guidance",
          "content": "Full-year expense guide trimmed to $113-118B, balancing lower personnel and non-headcount forecasts against higher infrastructure/Reality Labs COGS; full-year tax rate still 12-15%."
        }
      ]
    }
  },
  "analyst_questions": [
    {
      "analyst": "Brian Nowak",
      "firm": "Morgan Stanley",
      "topics": ["Llama", "Meta AI usage"],
      "questions": [
        "What are the most exciting Llama advancements (Behemoth, distillation, context window) and how do they tie to your product priorities?",
        "How is Meta AI traction evolving in the U.S. and what behaviors are you seeing across WhatsApp, Facebook, and the new Meta AI app?"
      ]
    },
    {
      "analyst": "Eric Sheridan",
      "firm": "Goldman Sachs",
      "topics": ["Meta AI app"],
      "questions": [
        "How does the stand-alone Meta AI app complement WhatsApp-based usage, and what’s the strategic role for each surface?"
      ]
    },
    {
      "analyst": "Justin Post",
      "firm": "BofA",
      "topics": ["Q2 guide", "CapEx"],
      "questions": [
        "How did macro uncertainty (e-commerce supply headwinds) influence the wide Q2 revenue range?",
        "How should we think about the CapEx ecosystem you’re building and the ROI without direct enterprise sales?"
      ]
    },
    {
      "analyst": "Douglas Anmuth",
      "firm": "JPMorgan",
      "topics": ["CapEx", "partnerships"],
      "questions": [
        "How much of the higher CapEx range is data center build-out versus hardware cost inflation, and what are the drivers?",
        "Are you still open to infrastructure partnerships or will Meta fund all future Llama training capacity?"
      ]
    },
    {
      "analyst": "Mark Shmulik",
      "firm": "Bernstein",
      "topics": ["AI coding", "expenses"],
      "questions": [
        "Where are you on the AI coding agent milestone and how will it accelerate product development?",
        "What explains the lowered expense outlook and does it change the cadence of investments?"
      ]
    },
    {
      "analyst": "Ross Sandler",
      "firm": "Barclays",
      "topics": ["capacity", "ads"],
      "questions": [
        "When will the capacity bottleneck ease for gen AI and core AI teams, and how is that influencing your CapEx timing?",
        "How healthy is the ad ranking ROI in the post-IDFA world and what inning are you in?"
      ]
    },
    {
      "analyst": "Kenneth Gawrelski",
      "firm": "Wells Fargo",
      "topics": ["WhatsApp for business", "2026 CapEx"],
      "questions": [
        "What capabilities must AI add to WhatsApp for business in high-cost markets, and how are business AI pilots progressing?",
        "Is the 2025 CapEx acceleration a new baseline for 2026, or do you reset the plan next year?"
      ]
    },
    {
      "analyst": "Youssef Squali",
      "firm": "Truist", 
      "topics": ["Meta AI competition", "DMA"],
      "questions": [
        "Will Meta AI face a winner takes most search-style dynamic, and what competitive advantages differentiate it?",
        "Any early sense of how the DMA decision on no-ads might impact EU revenue?"
      ]
    },
    {
      "analyst": "Mark Mahaney",
      "firm": "Evercore ISI",
      "topics": ["verticals", "Reality Labs"],
      "questions": [
        "Which advertising verticals showed softness besides China gaming after De Minimis?, and how are Reality Labs losses evolving as glasses scale?"
      ]
    }
  ],
  "metadata": {
    "parsed_date": "2025-05-15T00:00:00Z",
    "company_ticker": "META",
    "source": "Q1 2025 earnings call transcript"
  }
}
