{
    "ticker": "AAPL",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q3",
    "timeframe": {
      "quarter_start": "2025-03-30",
      "quarter_end": "2025-06-28",
      "earnings_release_date": "2025-07-31"
    },
    "documents": [
      {
        "id": "AAPL_FY25Q3_001",
        "title": "Apple reports third quarter 2025 results",
        "url": "https://www.apple.com/newsroom/2025/07/apple-reports-third-quarter-results/",
        "publisher": "Apple Newsroom",
        "published_date": "2025-07-31",
        "source_type": "official",
        "category": ["earnings", "company_results"],
        "event_date": "2025-06-28",
        "relevance": "Primary source for FY25 Q3 financials, headline metrics, and management commentary.",
        "summary": "Apple’s fiscal 2025 third quarter (June quarter) delivered record revenue of $94.0 billion, up 10% year over year, and record June-quarter EPS of $1.57, up 12%. Management highlighted double-digit growth in iPhone, Mac, and Services, growth in every geographic segment, and a new all-time high for Services revenue and for the active installed base of devices.",
        "key_points": [
          "Quarterly revenue: $94.0B, +10% YoY; June quarter record.",
          "Diluted EPS: $1.57, +12% YoY; June quarter record.",
          "Double-digit growth in iPhone, Mac, and Services; growth in all regions.",
          "Services revenue reached a new all-time high; installed base hit a new record.",
          "Board declared a $0.26 per share cash dividend, payable August 14, 2025."
        ],
        "embeddings_text": "For fiscal Q3 2025, the June quarter, Apple reported record revenue of $94.0 billion, up 10 percent year over year, and diluted EPS of $1.57, up 12 percent. Management emphasized that this was a June quarter record for total company revenue, iPhone revenue, and earnings per share. iPhone, Mac, and Services all grew at double-digit rates and every geographic region posted revenue growth. Services revenue reached a new all-time high and the installed base of active devices across all product categories hit a new record. Apple’s board declared a $0.26 per share dividend payable in mid-August 2025.",
        "tags": ["FY25-Q3", "earnings", "results", "services_record", "installed_base", "dividend"]
      },
      {
        "id": "AAPL_FY25Q3_002",
        "title": "Record-breaking Q3 2025: segment and regional breakdown",
        "url": "https://tidbits.com/2025/08/01/apple-reports-record-breaking-q3-2025-results/",
        "publisher": "TidBITS",
        "published_date": "2025-08-01",
        "source_type": "commentary",
        "category": ["earnings", "segment_analysis", "geography"],
        "event_date": "2025-06-28",
        "relevance": "Detailed analysis of Q3 2025 by product line and region, including Services mix, device segment performance, and geographic trends.",
        "summary": "Commentary on Q3 2025 notes that Apple generated $23.4B in profit on $94.0B of revenue. iPhone, Mac, and Services delivered double-digit growth, while iPad and Wearables declined. Services comprised roughly 29% of revenue and the Mac about 9%. iPhone still accounted for the largest share of earnings. Regionally, revenue grew in all segments, with particularly strong increases in Asia Pacific and Japan, and a rebound in China helped by local subsidies.",
        "key_points": [
          "Profit about $23.4B; EPS $1.57 on $94.0B revenue, +10% YoY.",
          "iPhone revenue rose ~13% YoY to about $44.6B, driven by the iPhone 16 lineup (notably iPhone 16e). :contentReference[oaicite:0]{index=0}",
          "Mac revenue increased ~15% YoY to around $8B, helped by M-series MacBook Air upgrades and strong enterprise demand. :contentReference[oaicite:1]{index=1}",
          "iPad revenue declined ~8% YoY to about $6.6B; Wearables, Home, and Accessories fell ~9% to about $7.4B. :contentReference[oaicite:2]{index=2}",
          "Services revenue grew ~13% to about $27.4B, roughly 29% of total revenue, benefitting from record App Store and iCloud cloud services revenue. :contentReference[oaicite:3]{index=3}",
          "Revenue grew across all regions: ~20% in Asia Pacific, 13% in Japan, 10% in Europe, 9% in the Americas, and 4% in Greater China, aided by Chinese consumer-electronics subsidies. :contentReference[oaicite:4]{index=4}"
        ],
        "embeddings_text": "Analysis of Apple’s Q3 2025 results shows revenue of $94.0 billion and profit of about $23.4 billion. iPhone, Mac, and Services all grew at double-digit rates, while iPad and Wearables declined year over year. iPhone revenue increased roughly 13 percent to about $44.6 billion, supported by the strength of the iPhone 16 family, particularly the mid-range iPhone 16e. Mac revenue rose about 15 percent to roughly $8 billion, driven by M-series MacBook Air upgrades and strong enterprise adoption. iPad revenue fell around 8 percent to about $6.6 billion and Wearables/Home/Accessories declined roughly 9 percent to about $7.4 billion, partly due to tough comparisons following earlier Vision Pro and accessory launches. Services generated around $27.4 billion, growing about 13 percent and representing close to 29 percent of total revenue, with contributions from the App Store, iCloud, and Apple TV+. Geographically, Apple posted growth in every region, including high-teens to low-20s growth in Asia Pacific and double-digit growth in Europe and Japan, while Greater China returned to modest growth helped by government subsidies that boosted iPhone and Mac sales.",
        "tags": ["segment_mix", "iphone", "mac", "ipad", "wearables", "services", "regional_growth", "china"]
      },
      {
        "id": "AAPL_FY25Q3_003",
        "title": "Q3 2025 revenue mix, product growth, and charts",
        "url": "https://sixcolors.com/post/2025/07/apple-q3-2025-results-and-charts-95b-revenue/",
        "publisher": "Six Colors",
        "published_date": "2025-07-31",
        "source_type": "commentary",
        "category": ["earnings", "segment_analysis", "visuals"],
        "event_date": "2025-06-28",
        "relevance": "Provides a visual and quantitative breakdown of Q3 2025 by segment, including YoY growth rates by product and the changing mix between Products and Services.",
        "summary": "Six Colors summarizes that Apple’s Q3 2025 revenue reached a record $94B, up 10% YoY, with strong growth in iPhone, Mac, and Services. Mac revenue grew about 15% YoY, iPhone and Services each grew around 13%, while iPad and Wearables declined. Charts illustrate the shifting share of revenue toward Services and visualize trends in each segment and region over time.",
        "key_points": [
          "Revenue: $94B, +10% YoY; Q3 record. :contentReference[oaicite:5]{index=5}",
          "Mac revenue up ~15% YoY; iPhone and Services up ~13% YoY each. :contentReference[oaicite:6]{index=6}",
          "Wearables/Home/Accessories down ~9% YoY; iPad revenue down ~8% YoY. :contentReference[oaicite:7]{index=7}",
          "Charts show Services’ share of revenue steadily rising and Products’ share gradually declining.",
          "Regional charts highlight faster growth outside the Americas and a rebound in Greater China from prior-quarter declines."
        ],
        "embeddings_text": "Visual analysis of Apple’s fiscal Q3 2025 results highlights $94 billion in revenue, a 10 percent year-over-year increase and the highest June quarter in the company’s history. iPhone, Mac, and Services were the key growth engines, with Mac revenue up roughly 15 percent and both iPhone and Services revenue growing about 13 percent compared to the prior year. In contrast, the iPad and Wearables/Home/Accessories segments declined at high single-digit rates. Charts in the analysis underscore the long-running shift in Apple’s mix toward higher-margin Services, the recovery in Mac demand following earlier weakness, and a modest rebound in Greater China. The overall picture is of a business increasingly driven by Services layered on top of a still-healthy iPhone franchise and a resurgent Mac line.",
        "tags": ["segment_growth", "revenue_mix", "charts", "services_share", "greater_china"]
      },
      {
        "id": "AAPL_FY25Q3_004",
        "title": "Q3 2025 market reaction, tariffs, and AI investment",
        "url": "https://www.investopedia.com/apple-earnings-fq3-fy2025-11782673",
        "publisher": "Investopedia",
        "published_date": "2025-08-01",
        "source_type": "news",
        "category": ["market_reaction", "tariffs", "ai_strategy"],
        "event_date": "2025-07-31",
        "relevance": "Captures investor reaction to Q3 2025 earnings, highlights record Services revenue and tariffs, and describes Apple’s AI investment posture and Siri roadmap.",
        "summary": "Apple’s Q3 2025 results beat expectations with $94.04B in revenue and net income of $23.43B ($1.57 per share). Services revenue hit a record ~$27.4B, up about 13% YoY; iPhone sales rose 13% to ~ $44.6B; and Mac revenue increased ~15% to just over $8B. The article notes roughly $800M in tariff-related costs during the quarter and management guidance that tariff impacts could exceed $1.1B next quarter. Tim Cook emphasized a significant ramp-up in AI investment and confirmed that a more personalized, AI-enhanced Siri is planned for 2026. Apple’s stock rose modestly after the release but remained down double digits year-to-date amid tariff and AI competitiveness concerns. :contentReference[oaicite:8]{index=8}",
        "key_points": [
          "Revenue ~$94.0B and EPS $1.57, both ahead of expectations. :contentReference[oaicite:9]{index=9}",
          "Services revenue around $27.4B, up ~13% YoY; iPhone revenue about $44.6B, up ~13%; Mac revenue around $8.0B, up ~15%. :contentReference[oaicite:10]{index=10}",
          "Apple incurred roughly $800M in tariff-related costs in Q3 2025 and guided to about $1.1B in tariff impact for the following quarter if policies remained unchanged. :contentReference[oaicite:11]{index=11}",
          "Cook described AI as a profound technology and said Apple is significantly increasing AI investment, including capex for data centers and third-party capacity. :contentReference[oaicite:12]{index=12}",
          "Cook reiterated that a more advanced, personalized Siri experience is targeted for release in 2026, not yet in FY25. :contentReference[oaicite:13]{index=13}",
          "Shares rose a bit in after-hours trading on the earnings beat but remained down meaningfully year-to-date due to tariff worries and competitive AI narratives. :contentReference[oaicite:14]{index=14}"
        ],
        "embeddings_text": "Investor-oriented coverage of Apple’s fiscal Q3 2025 results emphasizes that the company beat expectations with roughly $94 billion in revenue and earnings per share of about $1.57. Services revenue reached a record of around $27.4 billion, while iPhone and Mac revenues grew around the low- to mid-teens percentages. At the same time, Apple absorbed roughly $800 million in tariff-related costs in the June quarter and signaled a potential impact of about $1.1 billion in the following quarter if current tariff policies persist. Tim Cook framed artificial intelligence as one of the most important technologies of the era and said Apple is significantly increasing its AI investment, including capital expenditures on data-center infrastructure and cloud capacity, while reiterating that a much more capable, personalized Siri is planned for 2026. Equity markets responded positively to the earnings beat but continued to discount ongoing trade-policy risk and concerns about Apple’s pace in AI relative to other large tech companies.",
        "tags": ["market_cap", "earnings_reaction", "tariffs", "ai_investment", "siri_2026"]
      },
      {
        "id": "AAPL_FY25Q3_005",
        "title": "Tariff-driven demand pull-forward and supply chain diversification in Q3 2025",
        "url": "https://tidbits.com/2025/08/01/apple-reports-record-breaking-q3-2025-results/",
        "publisher": "TidBITS",
        "published_date": "2025-08-01",
        "source_type": "commentary",
        "category": ["tariffs", "macro", "supply_chain"],
        "event_date": "2025-06-28",
        "relevance": "Explains how tariffs influenced Q3 revenue growth, demand timing, and Apple’s manufacturing footprint across China, India, and Vietnam.",
        "summary": "In discussing Q3 2025, TidBITS notes that about 1 percentage point of Apple’s 10% revenue growth stemmed from customers buying ahead of potential tariff-linked price increases. That pull-forward represented roughly $820M of incremental revenue. Tariffs cost Apple around $800M in the quarter, and management projected roughly $1.1B of tariff impact for the September quarter. The article also highlights Apple’s shift of the majority of U.S. iPhone production to India and other products to Vietnam, while most devices for non-U.S. markets still originate from China, where consumer-electronics subsidies aided sales. :contentReference[oaicite:15]{index=15}",
        "key_points": [
          "Approx. $820M of Q3 revenue attributed to customers advancing purchases ahead of possible tariff-related price hikes, estimated as 1% of the 10% YoY revenue growth. :contentReference[oaicite:16]{index=16}",
          "Tariffs cost Apple about $800M in Q3 2025; management estimated about $1.1B in tariff impact for the following quarter. :contentReference[oaicite:17]{index=17}",
          "Apple shifted production of a majority of iPhones sold in the U.S. to India and routed many other U.S.-bound products through Vietnam, while most non-U.S. devices remained China-made. :contentReference[oaicite:18]{index=18}",
          "Regional governments in China provided subsidies for consumer electronics, helping Apple secure top smartphone and PC rankings in urban China. :contentReference[oaicite:19]{index=19}",
          "The article frames Apple’s near-term challenge as balancing complex international trade dynamics with the need to maintain margins and competitive pricing."
        ],
        "embeddings_text": "A key nuance in Apple’s Q3 2025 performance is the role of tariffs and supply-chain shifts. Management indicated that about one percentage point of the company’s 10 percent revenue growth in the quarter came from customers bringing forward purchases to avoid potential tariff-driven price increases, adding roughly $820 million of incremental revenue relative to a normal demand pattern. At the same time, Apple absorbed about $800 million in tariff costs and projected around $1.1 billion in tariff impact for the following quarter if existing policies stayed in place. To mitigate long-term exposure, Apple has moved the majority of U.S. iPhone production to India and shifted many other U.S.-destined products to Vietnam, while still relying heavily on China for devices sold in other markets. Chinese regional subsidies for consumer electronics supported Apple’s sales and helped its devices rank at the top of multiple categories in urban China. For Q3 2025 analysis, this context clarifies that part of the strong growth reflects one-off timing and that margin pressure from tariffs remains a structural risk.",
        "tags": ["tariffs", "pull_forward", "india_manufacturing", "vietnam", "china_subsidies", "margin_risk"]
      },
      {
        "id": "AAPL_FY25Q3_006",
        "title": "Apple Intelligence expansion across devices at WWDC 2025",
        "url": "https://www.apple.com/newsroom/2025/06/apple-intelligence-gets-even-more-powerful-with-new-capabilities-across-apple-devices/",
        "publisher": "Apple Newsroom",
        "published_date": "2025-06-10",
        "source_type": "official",
        "category": ["ai", "platform", "developer_tools"],
        "event_date": "2025-06-10",
        "relevance": "Major AI platform update announced during Q3 2025 that shapes Apple’s competitive positioning and upgrade narrative referenced on the earnings call.",
        "summary": "At WWDC 2025, held during Apple’s Q3, the company announced new Apple Intelligence capabilities across iPhone, iPad, Mac, Apple Watch, and Vision Pro. It introduced access for developers to an on-device foundation model API for private, intelligent experiences and previewed features like summarization, writing tools, and visual understanding embedded into system apps. :contentReference[oaicite:20]{index=20}",
        "key_points": [
          "Apple Intelligence uses on-device foundation models, with optional cloud support, to power private AI features across Apple platforms. :contentReference[oaicite:21]{index=21}",
          "Developers can call Apple Intelligence APIs to add contextual, privacy-preserving AI to their apps.",
          "Features include text rewriting and summarization, image understanding in Photos and Messages, and more proactive assistance in system experiences. :contentReference[oaicite:22]{index=22}",
          "Tim Cook and Craig Federighi reiterated that a more ambitious Siri overhaul is delayed until 2026 due to reliability constraints, but the current roadmap still leans heavily on Apple Intelligence. :contentReference[oaicite:23]{index=23}",
          "WWDC 2025 also introduced the new “Liquid Glass” design language that will roll out in iOS 26, macOS Tahoe, and other OS updates, tying the AI narrative to a broad UX refresh. :contentReference[oaicite:24]{index=24}"
        ],
        "embeddings_text": "During fiscal Q3 2025, Apple used WWDC to expand its Apple Intelligence initiative. The company announced that compact on-device foundation models, optionally backed by cloud models, will power a range of privacy-preserving AI capabilities across iPhone, iPad, Mac, Apple Watch, and Vision Pro. Developers gained APIs that let their apps tap into these models for tasks like rewriting and summarizing text, understanding images in Photos and Messages, and providing more contextual assistance throughout the system. At the same keynote, Apple unveiled a new design language called Liquid Glass that will debut with iOS 26, macOS Tahoe, and other OS releases later in the year. Executives acknowledged that a fully overhauled, AI-driven Siri experience has been delayed until 2026, but positioned Apple Intelligence and the new OS designs as the key near-term pillars of the company’s AI and UX strategy. These announcements formed an important backdrop for the June-quarter earnings call, where Apple highlighted AI and design updates as future drivers of device upgrades and Services engagement.",
        "tags": ["apple_intelligence", "on_device_ai", "developer_apis", "liquid_glass", "wwdc25", "siri_delay"]
      },
      {
        "id": "AAPL_FY25Q3_007",
        "title": "Dividend and capital return context around Q3 2025",
        "url": "https://www.sec.gov/Archives/edgar/data/320193/000032019325000071/a8-kex991q3202506282025.htm",
        "publisher": "SEC / Apple 8-K",
        "published_date": "2025-07-31",
        "source_type": "regulatory",
        "category": ["capital_return", "dividends", "buybacks"],
        "event_date": "2025-07-31",
        "relevance": "Provides official confirmation of dividend policy and ties into the broader FY25 capital return program that affects per-share metrics used in Q3 analysis.",
        "summary": "In the 8-K accompanying Q3 2025 results, Apple confirmed the $0.26 per share quarterly dividend payable August 14, 2025 and referenced its ongoing share-repurchase authorization, which was expanded earlier in FY25 by an additional $100B. These capital return actions contribute to EPS growth and influence share count trends in valuation models. :contentReference[oaicite:25]{index=25}",
        "key_points": [
          "Board declared a $0.26 per share dividend payable August 14, 2025, to shareholders of record on August 11, 2025. :contentReference[oaicite:26]{index=26}",
          "Dividend reflects a 4% increase announced earlier in FY25 and signals Apple’s intent to raise the dividend annually, subject to Board approval. :contentReference[oaicite:27]{index=27}",
          "Apple continues to operate under a large share-repurchase authorization, expanded by up to $100B earlier in 2025. :contentReference[oaicite:28]{index=28}",
          "Capital return via dividends and buybacks remains a core element of Apple’s cash-deployment framework and is an important driver of per-share earnings metrics in Q3 2025 and beyond."
        ],
        "embeddings_text": "The regulatory filings that accompany Apple’s Q3 2025 earnings confirm that the company declared a quarterly cash dividend of $0.26 per share, payable on August 14, 2025, to shareholders of record as of August 11. This payout reflects a dividend increase that Apple announced earlier in fiscal 2025 and is consistent with its stated intention to raise the dividend annually. In parallel, Apple continues to execute one of the largest share-repurchase programs in corporate history, with an authorization that was extended by an additional $100 billion earlier in the year. Together, ongoing buybacks and a rising dividend form a central pillar of Apple’s capital return strategy, helping to support earnings per share growth and shareholder returns around the Q3 2025 period.",
        "tags": ["dividend_0_26", "share_repurchases", "capital_allocation", "eps_support"]
      }
    ]
  }
  