{
  "company_name": "Salesforce",
  "quarter": "Q2",
  "fiscal_year": "2026",
  "speakers": {
    "marc_benioff": {
      "role": "Chair & CEO",
      "responses": [
        {
          "topic": "Agentic Enterprise Momentum",
          "content": "We closed the first half with outstanding performance—$10.2B revenue, 10% growth, 34.3% non-GAAP margin—and the best part is seeing every customer become an agentic enterprise. Agent Force, Data Cloud, Tableau and Slack are now all deeply agentic, and you can see humans and agents working together in every workflow."
        },
        {
          "topic": "Data Cloud as the Heart of Accuracy",
          "content": "The Data Cloud and metadata fabric make our agents the most accurate in the industry. We're now powering millions of service, sales and marketing conversations while humans focus on higher-value decisions. It's a transformation that feels like the emergence of a new era of software."
        },
        {
          "topic": "Product & Customer Stories",
          "content": "Customers like DIRECTV, FedEx, Williams Sonoma and Indeed are already scaling agents across service, sales and commerce—saving hundreds of hours, slashing resolution times and turning every e-mail into a two-way conversation with agentic capabilities."
        }
      ]
    },
    "robin_washington": {
      "role": "President & COO",
      "responses": [
        {
          "topic": "Customer Success & Guidance",
          "content": "Data Cloud and Agent Force continue to scale—AI ARR hit $1.2B, up 120% year over year—and 40% of Q2 bookings came from existing customers expanding their investments. We're on track for FY26 revenue of $41.1B to $41.3B, 34.1% non-GAAP margin, and double-digit cash flow growth while expanding the agentic operating model globally."
        },
        {
          "topic": "Operational Excellence",
          "content": "As Customer 0, we're expanding 24/7 instant support to six new languages, launching dozens of specialized Slack agents, and building a lean agentic enterprise. We are reallocating resources to accelerate data and AI adoption while maintaining disciplined capital allocation."
        }
      ]
    },
    "miguel_milano": {
      "role": "President & CRO",
      "responses": [
        {
          "topic": "Booking Acceleration",
          "content": "Pipeline is growing in the high teens and big deals are approaching 20% growth. More than 40% of new Agent Force and Data Cloud bookings are now create-and-close, short-cycle opportunities. We're adding capacity—AE headcount is up 20% year over year—and the market is embracing the agentic enterprise."
        },
        {
          "topic": "Shopper & Partner Momentum",
          "content": "New Flex Credits make it easier for customers to experiment, and partnerships with Informatica, Blue Birds, Convergence AI and Regrello bring differentiated data and automation capabilities to our platform."
        }
      ]
    },
    "srini_tallapragada": {
      "role": "President & Chief Engineering and Customer Success Officer",
      "responses": [
        {
          "topic": "Pilot to Production",
          "content": "We built Agent Force Command Center to monitor thousands of conversations and deterministically surface high-fidelity responses. That, plus deep integrations with Data Cloud and closed-loop engineering, is why conversion from pilot to production jumped 60% quarter over quarter."
        }
      ]
    }
  },
  "analyst_questions": [
    {
      "analyst": "Kash Rangan",
      "firm": "Goldman Sachs",
      "topics": [
        "Macro",
        "AI Productivity"
      ],
      "questions": [
        "With all the AI enthusiasm, is there a risk the SaaS model becomes a crowded database, and how does the agentic enterprise compare to pure consumption plays?"
      ]
    },
    {
      "analyst": "Keith Weiss",
      "firm": "Morgan Stanley",
      "topics": [
        "Growth Drivers",
        "Execution"
      ],
      "questions": [
        "What catalyzed the 60% increase in pilot-to-production conversions, and how should we think about what production deals look like versus pilots?"
      ]
    },
    {
      "analyst": "Brent Thill",
      "firm": "Jefferies",
      "topics": [
        "Capital Allocation",
        "M&A"
      ],
      "questions": [
        "Does the $20B buyback expansion signal a heavier lean into repurchases, or can you still pursue opportunistic M&A while returning capital?"
      ]
    },
    {
      "analyst": "S. Kirk Materne",
      "firm": "Evercore ISI",
      "topics": [
        "Go-to-Market",
        "Segment Strategy"
      ],
      "questions": [
        "Is the mid-market a more durable growth vector, especially with the agentic ITSM product, and how are you rebalancing the go-to-market to address SMB and general business?"
      ]
    }
  ],
  "metadata": {
    "parsed_date": "2025-09-03T21:15:00.000Z",
    "company_ticker": "CRM",
    "source": "Q2 2026 earnings call transcript"
  }
}

