{
    "company_name": "Amazon",
    "quarter": "Q4",
    "fiscal_year": "2024",
    "speakers": {
      "andrew_jassy": {
        "role": "CEO",
        "responses": [
          {
            "topic": "Financial Performance and Overview",
            "content": "Today, we're reporting $187.8 billion in revenue, up 10% year over year. Given the way the dollar strengthened throughout the quarter, we saw $700 million more of foreign exchange headwind than we anticipated in guidance. Without that headwind, revenue would have been 11% year over year and exceeded the top end of our guidance. Operating income was $21.2 billion, up 61% year over year, and trailing 12-month free cash flow adjusted for equipment finance leases was $36.2 billion."
          },
          {
            "topic": "Stores Business and Prime",
            "content": "We saw a 10% year-over-year revenue growth in our North America segment and 9% year over year in our international segment. Our continued focus on expanding selection, lowering prices, and improving convenience drove strong unit growth that even outpaced our revenue growth. We launched Amazon Haul for U.S. customers in Q4, offering ultra-low-priced products. Customers saved more than $15 billion with our low everyday prices and events. We delivered over 9 billion units the same or next day around the world."
          },
          {
            "topic": "Cost to Serve and Logistics",
            "content": "We remain squarely focused on cost to serve in our fulfillment network. We've improved our placement of inventory so that even more items are closer to end customers. Ahead of Black Friday, we'd improved the percentage of order units available in the ideal building by over 40% year over year. We've reduced our global cost to serve on a per unit basis for the second year in a row while increasing speed and safety."
          },
          {
            "topic": "Advertising",
            "content": "Advertising generated $17.3 billion of revenue in the quarter, growing 18% year over year. That's a $69 billion annual revenue run rate. Sponsored products are doing well, and we're seeing momentum with Prime Video ads. We've made it easier to do full-funnel advertising, from broad reach to bottom-of-the-funnel sponsored products."
          },
          {
            "topic": "AWS and Generative AI",
            "content": "AWS grew 19% year over year and now has a $115 billion annualized revenue run rate. We are optimistic about the future of AI. We believe the AI world will mostly be built on top of the cloud with the largest portion on AWS. We have powerful capabilities in all three layers of the stack: custom silicon like Trainium2 (which offers 30-40% better price-performance), services like SageMaker for model builders, and Amazon Bedrock for leveraging frontier models. We also launched our own Nova models in Bedrock."
          },
          {
            "topic": "Amazon Q and Modernization",
            "content": "Amazon Q is the most capable generative AI-powered assistant for software development. It helped Amazon's teams save $260 million and 4,500 developer years in migrating applications. We've also launched Q transformations for mainframes, cutting migration time by more than 50%."
          },
          {
            "topic": "CapEx and AI Investment",
            "content": "We spent $26.3 billion in capex in Q4, and that is reasonably representative of what you could expect in annualized capex rate in 2025. The vast majority of that capex spend is on AI for AWS. We think virtually every application is going to be reinvented with AI, representing the biggest opportunity since cloud and potentially the Internet. We are also investing in our stores business to improve delivery speed and cost to serve."
          },
          {
            "topic": "AWS Growth Constraints",
            "content": "We could be growing faster if not for some constraints on capacity, such as chips from partners and power constraints. I predict those constraints will start to relax in the second half of '25."
          },
          {
            "topic": "AI Cost Curve and Inference",
            "content": "I believe the cost of inference will meaningfully come down. When you decrease the cost of a technology component, companies typically spend less per unit but end up spending more in total because they build more. Lower inference costs will allow companies to infuse all their applications with generative AI."
          },
          {
            "topic": "UPS and Logistics",
            "content": "UPS has been a partner for many years, but we have increasingly shipped a larger percentage of our shipments through our own logistics network to control costs and scale. We are able to handle the volume with our own logistics capability."
          },
          {
            "topic": "Robotics and Automation",
            "content": "We have seen cost savings, productivity improvements, and safety improvements from robotics. Our new facility in Shreveport puts together the next tranche of robotics initiatives, showing promising speed and cost improvements. We plan to expand this to other facilities."
          },
          {
            "topic": "Gen AI in Retail",
            "content": "We use AI for productivity (customer service chatbot, seller listing creation, inventory forecasting) and new experiences (Rufus, Amazon Lens, sizing recommendations). We have about 1,000 different generative AI applications built or in process."
          },
          {
            "topic": "Delivery Speed and Inbound Network",
            "content": "We have not seen diminishing returns in improving delivery speed; faster delivery leads to higher conversion and frequency. Our inbound network architectural changes have yielded early efficiencies, but we expect more tuning and refinement to drive further cost reductions throughout the year."
          },
          {
            "topic": "AI Agents and Discovery",
            "content": "Retailers will have their own say on how they interact with agents. Rufus continues to improve, helping customers find facts, summarize reviews, and answer personal questions about orders."
          }
        ]
      },
      "brian_olsavsky": {
        "role": "CFO",
        "responses": [
          {
            "topic": "Financial Results",
            "content": "Worldwide revenue was $187.8 billion, an 11% increase year over year excluding FX. Operating income was $21.2 billion, our largest ever. North America operating margin was 8%, and International operating margin was 3%. This marks the eighth consecutive quarter of margin improvement in both segments."
          },
          {
            "topic": "Cost Productivity",
            "content": "2024 marks the second year in a row where we've lowered our global cost to serve on a per-unit basis. We saw strong productivity in our transportation network and fulfillment centers. We have opportunities to keep lowering costs through better inventory placement and automation."
          },
          {
            "topic": "AWS Financials",
            "content": "AWS revenue was $28.8 billion, up 19% year over year. Operating income was $10.6 billion. Margins may fluctuate due to investments, but we increased the estimated useful life of servers, which contributed approximately 200 basis points to the margin increase in Q4."
          },
          {
            "topic": "Capital Investments",
            "content": "Capital investments were $26.3 billion in Q4. We think that run rate will be reasonably representative of our 2025 capital investment rate. The majority supports technology infrastructure for AWS and AI."
          },
          {
            "topic": "Q1 2025 Guidance",
            "content": "Q1 Net sales expected between $151 billion and $155.5 billion. Operating income expected between $14 billion and $18 billion. This includes the impact of useful life updates for servers (decrease to 5 years) and heavy equipment (increase to 13 years), which net out to various impacts on 2025 operating income."
          },
          {
            "topic": "AWS Margins Outlook",
            "content": "AWS margins will be lumpy over time. AI comes with lower initial margins and heavy investment, which is a headwind short term. However, long term, we feel margins will be comparable to non-AI business. We are focused on driving efficiencies in data centers and power."
          }
        ]
      }
    },
    "analyst_questions": [
      {
        "analyst": "Mark Mahaney",
        "firm": "Evercore ISI",
        "topics": ["CapEx 2025", "AWS Growth Constraints"],
        "questions": [
          "So, Brian, that's $100 billion capex we should think about in '25. And then Andy, were there any -- so would you describe that AWS growth as being currently moderated down by supply constraints? Do you see those across the industry or do you see those materially impacting AWS today?"
        ]
      },
      {
        "analyst": "Eric Sheridan",
        "firm": "Goldman Sachs",
        "topics": ["AI Cost Curve", "Open Source/DeepSeek Impact"],
        "questions": [
          "Andy, when you think about the news that came out of China over the last couple of weeks and think longer term about bending the cost curve lower with AI... how do you think about bending the cost curve and either speeding up or amplifying time deployment to market or possibly higher returns on capital for AI?"
        ]
      },
      {
        "analyst": "Doug Anmuth",
        "firm": "J.P. Morgan",
        "topics": ["AWS Margins", "Stores/UPS Shipping"],
        "questions": [
          "Brian, maybe you can talk a little bit more about margins there [AWS], just given that they've kind of moved between the mid-20s to high 30s... How should we think about that more normalized especially as you're investing that much more in generative AI? And then just on the stores side, can you talk about the impact of less volume going through your shipping partner, UPS, going forward?"
        ]
      },
      {
        "analyst": "Brian Nowak",
        "firm": "Morgan Stanley",
        "topics": ["Robotics Acceleration", "Gen AI in Retail"],
        "questions": [
          "Andy, maybe to drill a little bit into the robotics acceleration that you talked about, any new data points than you can share on learnings from Shreveport? And how do we think about sort of the scalability of savings... And then maybe just a bigger picture, gen AI, GPU-enabled changes. Do you have other examples of how you see the Amazon retail shopping experience changing throughout 2025?"
        ]
      },
      {
        "analyst": "John Blackledge",
        "firm": "TD Cowen",
        "topics": ["Delivery Speed", "Inbound Network Efficiencies"],
        "questions": [
          "Could you talk about the current speed of delivery? Maybe how much more room to go there and how is it driving the everyday essentials business? And then somewhat relatedly, any further color on inbound network efficiencies you would expect to see this year?"
        ]
      },
      {
        "analyst": "Michael Morton",
        "firm": "MoffettNathanson",
        "topics": ["AI Agents", "E-commerce Discovery"],
        "questions": [
          "I wanted to talk about the other side of the coin, and that's really the e-commerce discovery process that leads people to Amazon. There's a lot of companies rolling out agents and assistants... what do you think the changes coming to the e-commerce funnel over the next several years would be great?"
        ]
      }
    ],
    "metadata": {
      "parsed_date": "2025-02-06T00:00:00.000Z",
      "company_ticker": "AMZN",
      "source": "earnings_call_transcript_q4_2024"
    }
  }
