{
  "company_name": "NVIDIA",
  "quarter": "Q2",
  "fiscal_year": "2026",
  "speakers": {
    "jensen_huang": {
      "role": "CEO",
      "responses": [
        {
          "topic": "Record Blackwell momentum",
          "content": "GB200 NVLink72 demand remains extraordinary, GB300 production ramped quickly with 1,000 racks per week, and Blackwell Ultra is generating tens of billions while reasoning AI continues to flood token demand."
        },
        {
          "topic": "Rubin roadmap and AI factories",
          "content": "Rubin remains on schedule for next year, and every hyperscaler/enterprise is building AI factories with NVLink 72 plus Spectrum-XGS; Rubin will slot into the same chassis, keeping our annual cadence intact."
        },
        {
          "topic": "China and export controls",
          "content": "We continue to advocate for licenses, but the current policy kept H20 out of China; we can ship $2–5B of H20 if more licenses arrive, yet the quarter assumed zero China shipments."
        },
        {
          "topic": "Networking and infrastructure",
          "content": "Networking hit $7.3B thanks to Spectrum-X, Spectrum-XGS, InfiniBand XDR, NVLink switches, NVLink Fusion, and Quantum-X photonics—every gigawatt AI factory needs the low-latency fabric we keep building."
        }
      ]
    },
    "colette_kress": {
      "role": "CFO",
      "responses": [
        {
          "topic": "Record quarter execution",
          "content": "Revenue beat at $46.7B, Data Center grew 56% year-over-year, and we released $180M of H20 reserves alongside $650M of unrestricted H20 sales while still returning $10B to shareholders."
        },
        {
          "topic": "Guidance and spending",
          "content": "Q3 outlook assumes no H20 to China, GAAP/non-GAAP gross margins ~73.3%/73.5%, OpEx up ~8% sequentially, and full-year operating expense growth still in the high-30s range."
        },
        {
          "topic": "Capital allocation",
          "content": "Cash from operations exceeded $15B; we returned $10B and the Board added $60B to the repurchase authorization while CapEx funds Blackwell/GB300 ramp plus NVLink/Spectrum-X infrastructure."
        }
      ]
    }
  },
  "analyst_questions": [
    {
      "analyst": "Christopher Muse",
      "firm": "Cantor Fitzgerald",
      "topics": [
        "Wafer-to-rack lead times",
        "Growth outlook"
      ],
      "questions": [
        "With wafer-to-rack lead times near 12 months and Rubin on track for the second half, how do you see growth into 2026 split between networking and data center?"
      ]
    },
    {
      "analyst": "Vivek Arya",
      "firm": "Bank of America Securities",
      "topics": [
        "H20 licensing",
        "ASIC competition"
      ],
      "questions": [
        "What needs to happen on licenses for the $2–5B of China H20 demand, and do you worry ASIC-focused competitors taking share from your full-stack platform?"
      ]
    },
    {
      "analyst": "Benjamin Reitzes",
      "firm": "Melius Research",
      "topics": [
        "AI infrastructure spend",
        "Share of TAM"
      ],
      "questions": [
        "You cited a $3–4 trillion AI infrastructure opportunity—does that mean you expect to capture over 35% of the compute stack, and are power constraints the main limiter?"
      ]
    },
    {
      "analyst": "Joseph Moore",
      "firm": "Morgan Stanley",
      "topics": [
        "China future",
        "Blackwell licensing"
      ],
      "questions": [
        "What are the prospects for reopening China with H20 or Blackwell once licenses arrive, and how important is that market to your long-term leadership?"
      ]
    },
    {
      "analyst": "Aaron Rakers",
      "firm": "Wells Fargo",
      "topics": [
        "Spectrum-XGS",
        "Networking opportunity"
      ],
      "questions": [
        "How should we think about Spectrum-XGS sizing within Ethernet and data center interconnect spending as the AI super factory footprint grows?"
      ]
    },
    {
      "analyst": "Stacy Rasgon",
      "firm": "Bernstein Research",
      "topics": [
        "Revenue mix",
        "Product cadence"
      ],
      "questions": [
        "Of the $7B sequential growth, how should we apportion it across Blackwell, Hopper/H20, and networking given that Hopper still shipped and Blackwell remained the lion’s share?"
      ]
    },
    {
      "analyst": "Timothy Arcuri",
      "firm": "UBS",
      "topics": [
        "China exports",
        "Guidance"
      ],
      "questions": [
        "Is the outlook assuming zero China H20, and what conditions would need to change for you to resume those shipments?"
      ]
    }
  ],
  "metadata": {
    "parsed_date": "2025-08-27T00:00:00Z",
    "source": "NVIDIA FY 2026 Q2 earnings call transcript"
  }
}

