{
  "company_name": "Apple",
  "quarter": "Q1",
  "fiscal_year": "2019",
  "speakers": {
    "tim_cook": {
      "role": "CEO",
      "responses": [
        {
          "topic": "Wearables Growth",
          "content": "Yes. Amit, it’s Tim. If you look at the Apple, the Wearables as a category within the Wearables, Home and Accessories revenue, Wearables grew 44%. So, it was very strong, as you say. Both Apple Watch and AirPods did very well in terms of collecting new customers. Apple Watch in particular, 75% of the customers are new to the Apple Watch. And so, it’s still very much a selling to new customers at this point."
        },
        {
          "topic": "Apple TV+ Success Metrics",
          "content": "Hey, Tom, it’s Tim. We are primarily measuring our sales on the number of subscribers. As you can tell from the way that we launched the product, we started with a very aggressive price at $4.99. And in addition to that we have our bundle where if you buy pretty much any device, you’re getting a year for free. And so, we're very focused on subscribers. That said, the product itself is about storytelling. And we think if we do that well, then we will find that there will be some number of those that will also be critical acclaimed. And we're seeing that with the morning show, we're seeing that with Little America and others."
        },
        {
          "topic": "Apple Card Impact on iPhone Sales",
          "content": "So, retail stores did fantastic on iPhone, very strong double-digit growth in iPhone from a year-over-year point of view. And one of the factors that enabled that was the -- getting to a monthly payments on the Apple Card to make it very simple. Of course, that’s U.S. only at this point, but the U.S. is very key market for us. And so, it was an important part of it."
        },
        {
          "topic": "Product Development Cadence",
          "content": "Yes. We’re continuing to operate. And so, as you can tell, along with everything else going on, we were able to launch and ship the iPhone SE, the iPad Pro with the Magic Keyboard, and the MacBook Air. And so, the business continues and the new products are our lifeblood. And so, we’re continuing to work. Everybody’s getting used to the work-at-home. In some areas of the Company, people maybe even more productive, in some other areas they’re not as productive. And so, it’s mixed, depending upon what the roles are. But, as you can tell from what we did this quarter, despite the environment, we have our head down, are working because we know that our customers want the products that we’ve got. They’re even more important in these times."
        },
        {
          "topic": "Advertising and Privacy",
          "content": "I think, it is possible to have advertising in a straightforward manner that doesn’t encroach on people's privacy. I wouldn’t want to conjecture about us in that business. I think for the TV+ business, we feel strongly that what the customer wants is an add-free product, and so that's not our aversion to ads, it’s what we believe that a customer wants."
        },
        {
          "topic": "5G Capability and Demand Drivers",
          "content": "I think that we’ve had some great partners, not only in the U.S. but also around the world that are really helpful this quarter, as partners. And so, I think that probably a part of that is the level of investments they have. And then, a part of it is probably making sure that those customer stick with them in a environment where there's a lot of trading back and forth. So, I am optimistic that it will continue."
        },
        {
          "topic": "Wearables Capacity Constraints",
          "content": "I'm hopeful that the Series 3 will come in to balance during this quarter. On AirPods Pro, I don't have estimate for that for you. I just can't predict when at this point. We seem to be fairly substantially off their and we're working very hard to put in additional capacity."
        }
      ]
    },
    "luca_maestri": {
      "role": "CFO",
      "responses": [
        {
          "topic": "Gross Margins and Cost Savings",
          "content": "Yes. That's right, Amit. It’s about flat sequentially, and by the way significantly higher on a year-over-year basis. But on a sequential basis, you are right, on one side we got the loss of leverage from the usual seasonality but we expect that that loss of leverage will be offset by better mix and cost savings."
        },
        {
          "topic": "Operating Expenses and Cost Management",
          "content": "Yes. So, Shannon, as we said, we manage the Company for the long term, right? So, we know that the core of the business, the core of the Company is innovation and product and services development. So, we will continue to invest in our pipeline. We’re very excited about what we have in store. And so, we will continue to invest there. Obviously, we are aware of the environment and so, we will manage the SG&A portion of the company tightly. We are making new investments in the new services that we launched recently. As you know, we purchased the baseband activities from Intel. And obviously, we want to develop that technology because we consider it’s a core technology for us. And so, we will try to balance the need to continue to invest during difficult circumstances and the fact that we like to manage the business wisely."
        }
      ]
    }
  },
  "analyst_questions": [
    {
      "analyst": "Katy Huberty",
      "firm": "Morgan Stanley",
      "topics": ["Services Growth Deceleration", "Services Subscriber Growth"],
      "questions": [
        "Services growth did decelerate from the growth rates in recent quarters, so can you talk about the factors that played into that slower growth? And then, appreciate the new disclosure around paid subscribers. But if you compare what you added in 2018 versus what you expect to add over the next two years, that implies a slowdown in annual net new subscribers. So should we be thinking about services as a lower growth segment than what you experienced in 2018? And then I have a follow-up."
      ]
    },
    {
      "analyst": "Tom Forte",
      "firm": "D.A Davidson",
      "topics": ["Apple TV+ Success Metrics", "Apple Card Impact on iPhone Sales"],
      "questions": [
        "So, congrats on the launch of Apple TV+. I wanted to know internally, how you're getting success, is it truly on critical acclaim, is it on number of consumers that are using the service, contribution and service revenue, et cetera, et cetera? Thank you.",
        "Then, my second question is I think you indicated that last month we started offering consumers the ability to use their Apple Card to buy an iPhone on an installment basis. Can you talk about how that’s had an impact on your unit sales for iPhones?"
      ]
    },
    {
      "analyst": "Shannon Cross",
      "firm": "Cross Research",
      "topics": ["China Market Prior to Health Crisis", "Manufacturing Strategy"],
      "questions": [
        "I wanted to ask about the trajectory of Services gross margin, up about 500 basis points it appears year-over-year. You talked a little bit about sequential. But what's driving the improvement or will it be volatile as we go through the year depending on quarters and mix? Just whatever color you can give us as we start to forecast this?"
      ]
    },
    {
      "analyst": "Steve Milunovich",
      "firm": "Wolfe Research",
      "topics": ["iPhone Pricing Strategy", "Commodity Pricing Impact"],
      "questions": [
        "I just have a question on the free services. Can you just describe how the math works on that? Is it that the free services are non cash revenue that's getting booked in the Services revenue with no cost and then the costs come out of products? Can you just run us through what the current status versus how you were accounting for that before?",
        "So it did make services gross margin, got it. And then my other -- my second question is just, when you think about growth in Services, you have selling more to existing paid subscription customers or it's the 300 million going to 0.5 billion. If you can just talk at a high level as far as when you look at growth going forward, is it about -- what is the mix in terms of selling more to existing users, getting new users or -- and maybe some of the individual services that you see the biggest growth opportunity?"
      ]
    },
    {
      "analyst": "Krish Sankar",
      "firm": "Cowen & Company",
      "topics": ["Smartphone Market and 5G", "OpEx Impact"],
      "questions": [
        "First one, Tim, I just wanted to pick your brain a little bit on the overall smartphone market. There is a general view that when 5G phones come out they’re going to be more expensive due to higher component costs, but at the same time, it looks like you guys have proven that there is a market for low cost geographies to phones like iPhone SE. So, how do you see these two different segments within the smart phone market evolving over the next one to three years? And then, I had a follow-up for Luca.",
        "And then, a follow-up for Luca. OpEx as a percentage of sales for March looks like about 15% higher than in your prior quarters. Kind of curious how much of that is -- part of it is driven by some of your Intel modem asset purchases or TV+ in the OpEx or how do we think about it on a go forward basis? Is there a point in time where the OpEx spending tend to level off and you get some return on that or is it just the function of a faster revenue growth in future?"
      ]
    },
    {
      "analyst": "Chris Caso",
      "firm": "Raymond James",
      "topics": ["iPhone SE Strategy", "OpEx Investment Returns"],
      "questions": [
        "I wanted to follow up with another question on iPhone SE and the decision to bring it back and where it sits within the total iPhone strategy. And I guess, coupled with the fact that iPhone 11, you made the decision to bring that at a lower price point. What does that tell us with respect to your approach to iPhone pricing and flexibility? Is this helping to add users and kind of bring people into the ecosystem? And if so, what does that imply for gross margins?",
        "And I guess, follow-on question with regard to OpEx. And it has been growing at a faster rate than revenue for I guess largely over the last three years or so. Can you set us some expectation with regard to when you get a return on that investment? I understand there are new investments that are happening now. But, how should we think about potential leverage going forward? Is there a point in time where the OpEx spending tend to level off and you get some return on that or is it just the function of a faster revenue growth in future?"
      ]
    },
    {
      "analyst": "Mike Olson",
      "firm": "Piper Sandler",
      "topics": ["Wearables Ecosystem Impact", "Augmented Reality Impact"],
      "questions": [
        "So, slightly different take on an earlier question on Wearables, and that is, what impact you think Wearables is driving people into the Apple ecosystem? You mentioned 75% watch buyers are new to the Apple Watch, but are many of them new to Apple overall? I'm sure a lot of existing iPhone, iPads or Mac users are going to Wearables customers, but do you think Wearables bring people into the ecosystem to buy other devices in a material way?",
        "And then, I think you recently mentioned that augmented reality will pervade our entire lives. And I'm wondering if you could share your thoughts about how you think it starts to impact our lives most significantly. For example, will the inflection point in AR come from gaming or industrial usage or some other category? In other words, where will the average person kind of first feel that impact of AR on their lives in a significant way?"
      ]
    },
    {
      "analyst": "Ben Bollin",
      "firm": "UBS",
      "topics": ["Channel Inventory Levels", "Operating Expenses Impact"],
      "questions": [
        "Can you share a little bit about where you think channel inventory is? You talked about the tightness you saw exiting the June quarter for Mac and iPad.",
        "Any color you could share about the impact COVID had on OpEx in the quarter, be it work from home, stipends, travel, other employee support costs. And also how the company is thinking about the longer-term opportunity of employees working remotely maybe more permanently many considerations and how that could influence the future OpEx?"
      ]
    }
  ],
  "metadata": {
    "parsed_date": "2019-04-30T10:30:00.000Z",
    "company_ticker": "AAPL",
    "source": "earnings_call_transcript"
  }
}
