{
    "company_name": "Amazon",
    "quarter": "Q1",
    "fiscal_year": "2025",
    "speakers": {
      "andrew_jassy": {
        "role": "CEO",
        "responses": [
          {
            "topic": "Financial Overview and Innovation",
            "content": "Today we're reporting revenue up 10% year-over-year, excluding the impact from foreign exchange rates. Operating income is $18.4 billion up 20% year-over-year. We're pleased with our continued business progress, but more importantly with our pace of innovation and additional improvement in our customer experiences."
          },
          {
            "topic": "Stores Business and Fulfillment",
            "content": "In our stores business, we once again saw strong consumer resonance in our continued work on selection value and shipping speed. We welcomed well-known brands such as Oura Rings, Michael Kors, and The Ordinary, as well as a new shopping experience with Saks. We just rolled out a new inbound architecture that expands the share of products that we can place in each fulfillment center improving delivery speeds and lowering our cost to serve. In the first quarter, we once again set new delivery speed records."
          },
          {
            "topic": "Tariffs",
            "content": "Obviously none of us knows exactly where tariffs will settle or when. We haven't seen any attenuation of demand yet. To some extent, we've seen some heightened buying in certain categories that may indicate stocking up. Amazon is not uniquely susceptible to tariffs. Retailers who aren't buying directly from China are typically buying from companies who themselves are buying from China... marking these items up. The total tariff will be higher for these retailers than for China Direct Sellers. We also have extremely large selection... which means we're often able to weather challenging conditions better than others."
          },
          {
            "topic": "Everyday Essentials",
            "content": "In the first quarter, our Everyday Essentials grew more than twice as fast as the rest of our business and represented one out of every three units sold in the U.S. Even if you exclude Whole Foods Market and Amazon Fresh, Amazon is one of the largest grocers in the U.S. with over $100 billion in gross sales last year."
          },
          {
            "topic": "Advertising",
            "content": "We are pleased with the strong growth on a very large base generating $13.9 billion of revenue in the quarter and growing 19% year-over-year. We're seeing strength across our broad portfolio of full funnel advertising offerings. Amazon Ads provides brands with tools to reach targeted audiences in our own entertainment properties... live sports... audio content... and of course in our store."
          },
          {
            "topic": "AWS and Cloud Migration",
            "content": "AWS grew 17% year-over-year in Q1 and now sits at a $117 billion annualized revenue run rate. It's useful to remember that more than 85% of the global IT spend is still on premises, so not in the Cloud yet. It seems pretty straightforward to me that this equation will flip in the next 10 to 20 years. Before this generation of AI, we thought AWS had the chance to ultimately be a multi $100 billion revenue run rate business. We now think it could be even larger."
          },
          {
            "topic": "Generative AI Strategy",
            "content": "If you believe that every customer experience will be reinvented with AI, you're going to invest very aggressively in AI and that's what we're doing. You can see that in the thousand plus AI applications we're building... with our next generation of Alexa named Alexa+... and in the building blocks AWS is constructing. We're not dabbling here. We're very intentionally giving builders the broadest possible capabilities at every level of the AI stack."
          },
          {
            "topic": "AI Chips and Bedrock",
            "content": "Our new custom AI chip Trainium 2 is starting to lay in capacity in larger quantities with significant appeal. The 30% to 40% better price performance that Trainium 2 offers versus other GPU based instances is compelling. Amazon Bedrock continues to iterate quickly, adding Anthropic's Claude 3.7 Sonnet... Meta's Llama 4... DeepSeek R1 and Mistral AI's Pixtral Large. And of course, we offer our own Amazon Nova state-of-the-art foundation models."
          },
          {
            "topic": "AI Agents",
            "content": "Our intention is for agents to perform wide-ranging complex, multi-step tasks. We just released a research preview of Amazon Nova Act, a new AI model trained to perform actions within a web browser. It aims to move the current state-of-the-art accuracy of multi-step agentic actions from 30% to 60%, to 90-plus percent."
          },
          {
            "topic": "Amazon Q",
            "content": "This past quarter Q, the most capable generative AI assistance for accelerating software development... Customers are loving this. Our AI business has a multibillion dollar annual revenue run rate, continues to grow triple-digit year-over-year percentages."
          },
          {
            "topic": "Alexa+",
            "content": "In Q1, we introduced Alexa+. Our next-generation of Alexa personal assistant... can both answer virtually any question and to take actions, and is free with Prime or available to non-Prime customers. We are just starting to roll this out in the U.S."
          }
        ]
      },
      "brian_olsavsky": {
        "role": "CFO",
        "responses": [
          {
            "topic": "Financial Results",
            "content": "Worldwide revenue was $155.7 billion, a 10% increase year-over-year, excluding the impact of foreign exchange. Worldwide operating increase was $18.4 billion. These results include one-time charges related to some historical customer returns that have not yet been resolved and some costs to receive inventory that was pulled forward into Q1 ahead of anticipated tariffs. Without these charges, North America and international operating margins would have been approximately 90 basis points and 70 basis points higher."
          },
          {
            "topic": "Operations and Inventory",
            "content": "In Q1, our newly re-architected inbound network drove productivity in our fulfillment and transportation network... leading to better inventory placement and higher units per package. Better inventory placement remains a top priority. Better placement drives more in-stock selection, reduces travel distances, and speeds up delivery."
          },
          {
            "topic": "Advertising",
            "content": "Advertising remains an important contributor to profitability... Advertising revenues grew 19% year-over-year. We're pleased with the accelerating growth on an increasingly large base."
          },
          {
            "topic": "AWS Financials",
            "content": "AWS revenue was $29.3 billion in Q1, an increase of 17% year-over-year. AWS operating income was $11.5 billion. We plan to bring on an increasing amount of capacity in the back half of the year."
          },
          {
            "topic": "Capital Expenditures",
            "content": "Cash CapEx was $24.3 billion in Q1. The majority of the spend is to support the growing need for technology infrastructure. This primarily relates to AWS as we invest to support demand for our AI services, and increasingly in custom silicon like Trainium."
          },
          {
            "topic": "Net Income and Anthropic Gain",
            "content": "Our first quarter net income of $17.1 billion includes a pre-tax gain of $3.3 billion, included in non-operating income, and it relates to our investment in Anthropic. This activity is not related to Amazon's ongoing operations."
          },
          {
            "topic": "Q2 Guidance",
            "content": "Q2 net sales are expected to be between $159 billion and $164 billion. Q2 operating income is expected to be between $13 billion and $17.5 billion. This estimate includes the impact of our seasonal step-up in stock-based compensation expense in Q2."
          }
        ]
      }
    },
    "analyst_questions": [],
    "metadata": {
      "parsed_date": "2025-05-01T00:00:00.000Z",
      "company_ticker": "AMZN",
      "source": "earnings_call_transcript_q1_2025"
    }
  }
