{
    "ticker": "AAPL",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q2",
    "timeframe": {
      "quarter_start": "2024-12-29",
      "quarter_end": "2025-03-29",
      "earnings_release_date": "2025-05-01"
    },
    "documents": [
      {
        "id": "aapl-fy25-q2-001",
        "title": "Apple reports fiscal Q2 2025 results",
        "source_name": "Apple Newsroom",
        "source_type": "official",
        "source_url": "https://www.apple.com/newsroom/2025/05/apple-reports-second-quarter-results/",
        "published_at": "2025-05-01T00:00:00Z",
        "category": "earnings_release",
        "tags": [
          "results_headline",
          "services_growth",
          "capital_return",
          "installed_base",
          "environment"
        ],
        "relevance_notes": "Primary, authoritative summary of Apple’s FY25 Q2 results including revenue, EPS, capital returns, and management commentary.",
        "embeddings_text": "In its official press release for fiscal 2025 second quarter results, Apple reports revenue of 95.4 billion dollars, up 5 percent year over year, and diluted earnings per share of 1.65 dollars, up 8 percent year over year. Management highlights that Services revenue reached a new all-time high and that EPS set a March-quarter record. CEO Tim Cook emphasizes double-digit growth in Services, the addition of the iPhone 16e to the lineup, and new Macs and iPads built on Apple silicon, while also noting that Apple has reduced its carbon emissions by about 60 percent over the past decade. CFO Kevan Parekh points to 24 billion dollars in operating cash flow and notes that Apple returned 29 billion dollars to shareholders during the quarter. The installed base of active devices across iPhone, Mac, iPad, and other categories again reaches a new all-time high. Apple’s board declares a cash dividend of 0.26 dollars per share, a roughly 4 percent increase, and authorizes an additional share repurchase program of up to 100 billion dollars. The release reiterates that Apple continues to face macro, regulatory, and supply-chain risks, and directs investors to the company’s Form 10-Q and other SEC filings for detailed risk factors."
      },
      {
        "id": "aapl-fy25-q2-002",
        "title": "Apple Q2 2025 results and charts: product and services mix",
        "source_name": "Six Colors",
        "source_type": "commentary",
        "source_url": "https://sixcolors.com/post/2025/05/apple-q2-2025-results-and-charts-95-4b-revenue/",
        "published_at": "2025-05-01T20:41:00Z",
        "category": "results_analysis",
        "tags": [
          "segment_mix",
          "product_growth",
          "services_mix",
          "wearables_decline"
        ],
        "relevance_notes": "Concise breakdown of segment-level trends, useful for modeling mix shifts within Apple’s business during FY25 Q2.",
        "embeddings_text": "A Six Colors analysis of Apple’s fiscal Q2 2025 results notes that overall revenue of 95.4 billion dollars rose 5 percent versus the prior year period. At the product level, Mac revenue increases about 7 percent year over year, iPad revenue grows around 15 percent, iPhone revenue rises approximately 2 percent, and Services revenue grows around 12 percent, while the Wearables, Home, and Accessories category declines roughly 5 percent. The article focuses on how the revenue mix continues to tilt gradually toward Services and away from hardware categories that are more cyclical. Charts show the evolution of total revenue, profit, product-line contributions, and regional performance over time, highlighting Services as an increasingly important growth driver and showing wearables as a relative weak spot. The piece provides contextual commentary but largely reinforces Apple’s narrative of a stable, diversified revenue base with modest hardware growth and structurally higher-margin Services expansion."
      },
      {
        "id": "aapl-fy25-q2-003",
        "title": "Apple Q2 2025 Financials Solid Despite Upcoming Tariff Uncertainty",
        "source_name": "TidBITS",
        "source_type": "commentary",
        "source_url": "https://tidbits.com/2025/05/02/apple-q2-2025-financials-solid-despite-upcoming-tariff-uncertainty/",
        "published_at": "2025-05-02T00:00:00Z",
        "category": "results_analysis",
        "tags": [
          "tariffs",
          "services_record",
          "regional_mix",
          "china_slowdown",
          "dma_fine"
        ],
        "relevance_notes": "Adds numeric detail on profits, Services share, and regional trends, plus forward-looking commentary on tariffs and EU regulation.",
        "embeddings_text": "TidBITS describes Apple’s fiscal Q2 2025 results as solid, with profits of about 24.8 billion dollars, or 1.65 dollars per diluted share, on revenue of 95.4 billion dollars, representing roughly 5 percent year-over-year growth and below the 2022 record quarter. iPhone, Mac, and iPad all grow year over year, while Wearables decline slightly. Services stand out as the key growth engine, generating around 26.6 billion dollars in revenue, up roughly 2.7 billion dollars from the prior year and accounting for about 28 percent of Apple’s total revenue in the quarter. The article estimates iPad at about 7 percent of total revenue, Macs at 8 percent, and Wearables at 8 percent, with iPhone still representing roughly 49 percent of the mix. Regionally, Greater China revenue falls about 2.3 percent year over year and represents roughly 17 percent of total revenue, while the Americas, Japan, and the rest of Asia Pacific show mid- to high-single-digit growth and Europe grows closer to 1 percent. The analysis connects Europe’s sluggish growth partly to regulatory tensions, noting that Apple recently faced a roughly 570-million-dollar fine tied to EU Digital Markets Act violations relating to App Store steering rules. Looking ahead, the piece emphasizes that the dramatic tariff hikes announced in early April occur after the quarter’s end but are already shaping Apple’s strategy. Apple reportedly flies hundreds of tons of iPhones from India to the US and shifts more manufacturing to India and Vietnam to reduce exposure to China. CEO Tim Cook warns that tariffs could cost Apple around 900 million dollars in the following quarter, and the article characterizes this as a looming headwind layered on top of softer enthusiasm for Apple Intelligence and delays to a more advanced Siri, which may limit near-term product demand."
      },
      {
        "id": "aapl-fy25-q2-004",
        "title": "Apple reports Q2 2025 earnings: detailed segment numbers and expectations beat",
        "source_name": "9to5Mac",
        "source_type": "news",
        "source_url": "https://9to5mac.com/2025/05/01/apple-reports-q2-2025-earnings-with-95-4-billion-in-revenue/",
        "published_at": "2025-05-01T20:33:00Z",
        "category": "results_breakdown",
        "tags": [
          "top_line",
          "segment_detail",
          "consensus_vs_actual",
          "eps_surprise"
        ],
        "relevance_notes": "Good single-page snapshot of key line items, useful as canonical numeric inputs for Q2 2025 segment revenue.",
        "embeddings_text": "A 9to5Mac earnings recap reports that in fiscal Q2 2025 Apple generated 95.4 billion dollars of revenue versus Wall Street expectations of roughly 94.7 billion dollars, up from about 90.75 billion dollars in the same quarter a year earlier. Net income is about 24.78 billion dollars and diluted earnings per share come in at 1.65 dollars, modestly above consensus estimates near 1.63 dollars. The article lists segment revenue as approximately 46.84 billion dollars for iPhone, 7.95 billion dollars for Mac, 6.4 billion dollars for iPad, 7.52 billion dollars for Wearables, Home, and Accessories, and 26.64 billion dollars for Services. It notes that Apple’s commentary highlights strong Services growth, the role of iPhone 16e, and continued momentum in Mac and iPad following new Apple silicon devices. The piece positions the quarter as a clean beat on both revenue and EPS relative to expectations, sets up the subsequent earnings call for more color on tariffs and demand, and points readers back to the official Apple Newsroom release for full GAAP detail."
      },
      {
        "id": "aapl-fy25-q2-005",
        "title": "Apple Delivers Better-Than-Expected iPhone Sales, Announces $100B Buyback",
        "source_name": "Investopedia",
        "source_type": "news",
        "source_url": "https://www.investopedia.com/apple-earnings-q2-fy2025-11725219",
        "published_at": "2025-05-01T23:15:00Z",
        "category": "results_analysis",
        "tags": [
          "iphone_performance",
          "buybacks",
          "dividends",
          "tariffs",
          "supply_chain_shift",
          "stock_reaction"
        ],
        "relevance_notes": "Links Q2 results to capital return strategy, tariff risk, and supply-chain relocation; includes market reaction and valuation context.",
        "embeddings_text": "An Investopedia article frames Apple’s fiscal Q2 2025 as a quarter where the company delivered better-than-expected iPhone sales and announced an aggressive capital-return plan. It reports revenue of about 95.4 billion dollars, up 5 percent year over year, and net income of roughly 24.78 billion dollars or 1.65 dollars per share, both exceeding analyst forecasts. iPhone revenue is cited at around 46.84 billion dollars, up about 2 percent, with Mac and iPad each posting mid-single- to mid-teens growth, and Services revenue climbing roughly 12 percent to about 26.65 billion dollars. The piece highlights Apple’s new authorization for a 100-billion-dollar share repurchase program and a 4 percent increase in its quarterly dividend to 0.26 dollars per share. At the same time, it stresses emerging risks: CEO Tim Cook warns that recently imposed tariffs could add on the order of 900 million dollars to quarterly costs, and Apple is accelerating a strategic shift in its supply chain by moving more iPhone assembly for the US market from China to India and shifting production of iPads and Macs toward Vietnam. The article notes that, despite the earnings beat and capital-return news, Apple’s share price falls roughly 4 percent in after-hours trading as investors focus on tariff-related uncertainty and year-to-date underperformance of the stock."
      },
      {
        "id": "aapl-fy25-q2-006",
        "title": "Apple girds for more trade war pain, trims buyback",
        "source_name": "Reuters",
        "source_type": "news",
        "source_url": "https://www.reuters.com/technology/apple-edges-past-expectations-world-girds-tariff-impact-2025-05-01/",
        "published_at": "2025-05-02T05:36:00Z",
        "category": "macro_risk",
        "tags": [
          "trade_war",
          "tariffs",
          "buyback_change",
          "us_capex",
          "tariff_cost_guidance",
          "china_exposure"
        ],
        "relevance_notes": "Focuses on tariff escalation, lower buyback authorization vs prior year, and a massive US investment plan, all of which shape risk-reward framing for Q2 and beyond.",
        "embeddings_text": "A Reuters report on Apple’s fiscal Q2 2025 results emphasizes how trade tensions and tariff uncertainty are reshaping the company’s capital-allocation and supply-chain decisions. It states that Apple modestly beat consensus estimates with revenue of roughly 95.36 billion dollars and earnings per share of about 1.65 dollars, but simultaneously reduced the size of its share-repurchase authorization by around 10 billion dollars compared with the prior year’s buyback program. The article quotes CEO Tim Cook explaining that tariffs linked to the US–China trade dispute could add roughly 900 million dollars in costs in the following quarter. To mitigate this risk, Apple is shifting a greater share of iPhone production for the US market to India and moving more Mac, iPad, Apple Watch, and AirPods manufacturing to Vietnam, while also building up inventory so that many near-term US device sales will draw on non-China production. Reuters reports that Apple is planning or committing to as much as 500 billion dollars of aggregate spending to expand its US footprint, including new server and chip-related facilities built with partners, which will increase both capital expenditures and operating costs. Analysts interviewed in the article interpret the trimmed buyback and massive investment as evidence that Apple is conserving cash and preparing for a more challenging operating environment even as the current quarter looks solid. The story notes that Apple shares fall about 4 percent after the release as investors react to the trade-war narrative and lower buyback magnitude."
      },
      {
        "id": "aapl-fy25-q2-007",
        "title": "What analysts thought of Apple stock ahead of FY25 Q2 earnings",
        "source_name": "Investopedia",
        "source_type": "news",
        "source_url": "https://www.investopedia.com/what-analysts-think-of-apple-stock-ahead-of-earnings-q2-fy2025-update-11723106",
        "published_at": "2025-05-01T15:57:00Z",
        "category": "pre_earnings_sentiment",
        "tags": [
          "analyst_ratings",
          "price_targets",
          "consensus_estimates",
          "china_manufacturing",
          "tariff_risk"
        ],
        "relevance_notes": "Captures expectations and sell-side narrative immediately before Q2 results, useful for modeling surprise and sentiment shift.",
        "embeddings_text": "A pre-earnings Investopedia article surveys analyst opinions on Apple ahead of the fiscal Q2 2025 release. It explains that investors are focused on how shifting trade policies and tariff threats might affect a company that still manufactures an estimated 90 percent of its products in China. Bank of America maintains a buy rating but cuts its price target from 250 dollars to 240 dollars per share, citing economic uncertainty and the risk that tariffs and weaker consumer spending could weigh on demand, even if there is some short-term pull-forward of purchases. The piece notes that, among roughly 15 analysts tracked, nine rate Apple as a buy, four as a hold, and two as a sell, with a consensus price target around 232 dollars implying about 9 percent upside from a share price near 212 dollars. The article reports that Apple shares are down roughly 15 percent year to date going into the print, framing the stock as under pressure despite Apple’s defensive qualities. Consensus expectations for the quarter call for revenue around 94.72 billion dollars, up about 4 percent year over year, and net income of approximately 24.47 billion dollars, or 1.63 dollars per share, up from 1.53 dollars per share a year earlier. The article also discusses reports that Apple plans to move assembly of all iPhones sold in the US to India by 2026 as a structural response to tariff risk, a theme that directly connects to supply-chain commentary on the subsequent earnings call."
      },
      {
        "id": "aapl-fy25-q2-008",
        "title": "Apple Q2 2025 Form 10-Q: management discussion, margins, and segment detail",
        "source_name": "Apple / SEC",
        "source_type": "official",
        "source_url": "https://s2.q4cdn.com/470004039/files/doc_earnings/2025/q2/filing/10Q-Q2-2025-as-filed.pdf",
        "published_at": "2025-05-01T00:00:00Z",
        "category": "regulatory_filing",
        "tags": [
          "10q",
          "gross_margin",
          "operating_income",
          "r_and_d_spend",
          "segment_disclosure",
          "risk_factors"
        ],
        "relevance_notes": "Regulatory backbone for the quarter; contains detailed financial statements, margin data, and risk-factor language suitable for more technical RAG queries.",
        "embeddings_text": "Apple’s Form 10-Q for the quarter ended March 29, 2025 provides detailed financial statements and management’s discussion and analysis that complement the headline fiscal Q2 2025 results. The filing shows segment operating income of around 40.1 billion dollars for the first half of the fiscal year versus approximately 37.7 billion dollars a year earlier, with research and development expense for the quarter climbing to roughly 8.55 billion dollars and total operating income for the first six months of the year reaching about 72.4 billion dollars. The report breaks out revenue and operating margin by product category and geography, confirming the narrative of modest iPhone growth, stronger iPad and Mac trends, record Services revenue, and continued weakness in Wearables. Management reiterates that Apple faces macroeconomic headwinds, foreign-exchange volatility, competitive risks, and elevated regulatory scrutiny, and it calls out supply-chain concentration in a small number of suppliers and regions as a key vulnerability. The risk section highlights exposure to changing trade and tariff regimes, ongoing legal and regulatory proceedings in major markets, and data-privacy and cybersecurity issues. For RAG use cases, the 10-Q is the canonical source for GAAP definitions, detailed segment and regional tables, and the formal description of risks that underlie the softer language in earnings-call commentary and news coverage."
      }
    ]
  }
  