{
  "company_name": "Salesforce",
  "quarter": "Q1",
  "fiscal_year": "2026",
  "speakers": {
    "marc_benioff": {
      "role": "Chair & CEO",
      "responses": [
        {
          "topic": "Informatica Deal & Data AI Vision",
          "content": "We announced the $8B Informatica acquisition to unite the #1 AI CRM with the leading AI MDM/ETL platform because every AI transformation is a data transformation. We need to harmonize enterprise data, and Informatica accelerates that mission so agents can deliver trusted insights."
        },
        {
          "topic": "Q1 Results & Agentforce Momentum",
          "content": "Q1 revenue $9.83B (+8% Y/Y), 32.3% non-GAAP margin, $6.5B operating cash flow, 60.9B RPO (+13%). We now have 4,000 paid Agentforce customers, 800 in production, 8,000 deals overall, and more than $1B in Data Cloud + Agentforce ARR. FlexCredits, FedRAMP High, and our ADAM (Agents, Data, Apps, Metadata) framework keep us ahead."
        },
        {
          "topic": "Growth Transformation",
          "content": "With ADAM live across Customer 360, Slack, and Tableau Next, we're scaling digital labor globally. We're reinvesting in sales distribution, especially SMB/mid-market, and building 1,000+ new reps while protecting margins and cash flow, to chase the multitrillion-dollar AI opportunity."
        }
      ]
    },
    "robin_washington": {
      "role": "President & COFO",
      "responses": [
        {
          "topic": "Capital Allocation & Execution Priorities",
          "content": "My CoFO priorities: deliver customer success and accelerate AI adoption, drive operational excellence, and allocate capital responsibly. We returned $3.1B in Q1 (share repurchases + dividend) and raised dividends 4% while keeping accretive M&A discipline."
        },
        {
          "topic": "Customer Success Flywheel",
          "content": "More than half of Q1 top 100 deals included 6+ clouds, Tableau appeared in 70% of $1M+ deals, MuleSoft in nearly half, and partners played a critical role in 7 of the top 10 wins. The ADAM flywheel is lowering attrition as customers adopt Data Cloud and Agentforce."
        }
      ]
    },
    "srinivas_pingala": {
      "role": "Chief Engineering & Customer Success Officer",
      "responses": [
        {
          "topic": "ADAM Framework & Forward Deployment",
          "content": "The agentic layer must live on top of trusted data, so Data Cloud, MuleSoft, Tableau, and soon Informatica create the enterprise-grade metadata platform agents need. We created forward-deployed engineering teams, iterating daily with customers to accelerate consumption, observability, and trust."
        }
      ]
    },
    "miguel_milano": {
      "role": "President & Chief Revenue Officer",
      "responses": [
        {
          "topic": "Distribution & Growth",
          "content": "We added capacity—14% growth in AEs, aiming for 22% by year-end—focused on SMB/mid-market where we saw surprising momentum. Pipeline velocity is double-digit, AWS Marketplace continues to triple YoY, and we're pushing every rep to sell Data Cloud and Agentforce to accelerate expansion."
        }
      ]
    }
  },
  "analyst_questions": [
    {
      "analyst": "Keith Weiss",
      "firm": "Morgan Stanley",
      "topics": [
        "Growth Acceleration",
        "Agentforce"
      ],
      "questions": [
        "Which puts and takes should we watch for growth acceleration? You raised guidance to $41.3B—what's driving that, and how do you plan to maintain margin and cash flow while investing?"
      ]
    },
    {
      "analyst": "Brent Thill",
      "firm": "Jefferies",
      "topics": [
        "Macro",
        "Pipeline"
      ],
      "questions": [
        "With macro uncertainty, tariffs, and FX, what are you seeing in pipeline behavior and headroom in demand?"
      ]
    },
    {
      "analyst": "Raimo Lenschow",
      "firm": "Barclays",
      "topics": [
        "Tableau & Informatica",
        "Platform Integration"
      ],
      "questions": [
        "How does Tableau and the impending Informatica deal change the platform story and accelerate agentic outcomes?"
      ]
    },
    {
      "analyst": "Brad Sills",
      "firm": "Bank of America",
      "topics": [
        "Agentforce Indicators"
      ],
      "questions": [
        "What leading indicators convince you that this agentic AI cycle is material—data adoption, pilots, consumption metrics?"
      ]
    },
    {
      "analyst": "Brad Zelnick",
      "firm": "Deutsche Bank",
      "topics": [
        "Use Cases",
        "ROI"
      ],
      "questions": [
        "What has surprised you on use cases, ROI, and geographic adoption of Agentforce plus Data Cloud this quarter?"
      ]
    },
    {
      "analyst": "Kash Rangan",
      "firm": "Goldman Sachs",
      "topics": [
        "Enterprise Adoption",
        "Informatica"
      ],
      "questions": [
        "What still holds back enterprise AI adoption compared to consumer; why do we need Informatica now, and when will the deal be accretive?"
      ]
    },
    {
      "analyst": "Mark Murphy",
      "firm": "JPMorgan",
      "topics": [
        "Digital Labor",
        "Employment"
      ],
      "questions": [
        "How can Salesforce help companies navigate AI-driven workforce changes while preserving human oversight?"
      ]
    }
  ],
  "metadata": {
    "parsed_date": "2025-05-28T16:30:00.000Z",
    "company_ticker": "CRM",
    "source": "Q1 2026 earnings call transcript & press release"
  }
}

